[
  {
    "index": "#",
    "terms": [
      {
        "term": "3-click Rule",
        "description": "The 3-click rule is an un-official design heuristic which states that no webpage, key information or task should take more than 3 clicks to access or accomplish. The rule assumes that a visitor would get frustrated and abandon his information seeking task if it takes more than 3 clicks. However, there has been no data or studies to corroborate the assertions made by the rule."
      },
      {
        "term": "5-second test",
        "description": "An experiment where a designer shows a mockup of a website or a mobile app to a bunch of users for a short-period of time say 5 seconds and asks them describe their response. The test is done to evoke gut reactions."
      }
    ]
  },
  {
    "index": "a",
    "terms": [
      {
        "term": "A/B Testing",
        "description": "A/B testing (also known as split-run testing or bucket testing) is an user experience research method of comparing two versions of a webpage or app against each other to determine which one performs better. A/B testing is essentially an experiment where two or more variants of a page are shown to users at random, and statistical analysis is used to determine which variation performs better for a given conversion goal."
      }
    ]
  },
  {
    "index": "b",
    "terms": [
      {
        "term": "Breadcrumb",
        "description": "Breadcrumb is a navigational element which helps users identify their current location in a site’s hierarchical structure. Generally breadcrumbs are used to supplement a site’s global or local navigation system. On screen, breadcrumbs are visually rendered as a trail of links listing grandparent, parent pages all the way to the current page usually separated by a “/” and “>” character."
      }
    ]
  },
  {
    "index": "c",
    "terms": [
      {
        "term": "Card sorting",
        "description": "Before we get to card sorting we need to understand what information architecture is. Information architecture or IA as it is commonly known, refers to how information is organized on a website or application. Card sorting is a UX research technique that helps site owners improve information architecture by getting users involved in structuring the content of the website. This typically involves a session where the various elements of the website are written down as cards and users are asked to collect them into groups."
      }
    ]
  },
  {
    "index": "d",
    "terms": [
      {
        "term": "Data driven decision",
        "description": "When you make design decisions based on empirical observation instead of guesses."
      },
      {
        "term": "Design thinking",
        "description": "Keeping your users at the center of the design process."
      }
    ]
  },
  {
    "index": "e",
    "terms": [
      {
        "term": "Empathy Map",
        "description": "Deeply understanding the needs of the user is key in user-centered design. Though qualitative research methods like usability testing, surveys or user interviews can help you understand various aspects of the user, you need a visualization tool to distill and capture who your users are as a whole. Empathy mapping, a technique employed in the beginning of the UX process can help you achieve this. Empathy maps are divided into four quadrants. With each quadrant capturing what the user says, thinks, does, and feels."
      }
    ]
  },
  {
    "index": "f",
    "terms": []
  },
  {
    "index": "g",
    "terms": [
      {
        "term": "Gamification",
        "description": "Gamification is a technique or tool to enhance user experience. This involves adding gaming elements like badges, leaderboards or rewards to traditional non-gaming environments of an existing system to incentivise users to engage with the product."
      }
    ]
  },
  {
    "index": "h",
    "terms": []
  },
  {
    "index": "i",
    "terms": []
  },
  {
    "index": "j",
    "terms": []
  },
  {
    "index": "k",
    "terms": []
  },
  {
    "index": "l",
    "terms": []
  },
  {
    "index": "m",
    "terms": []
  },
  {
    "index": "n",
    "terms": [
      {
        "term": "Net Promoter Score",
        "description": "Net Promoter Score®, or NPS®, measures customer experience and predicts business growth. It is a management tool that aims to measure the loyalty that exists between a provider and a consumer. The provider can be a company, employer or any other entity. It can also be used as an alternative to traditional customer satisfaction research."
      },
      {
        "term": "Neomorphism",
        "description": "Neumorphism (also neomorphism) as the name suggests is a new take on skeuomorphic design. Even though it relates to skeuomorphism, where interface components mimic their real-world counterparts in how they appear or how a user can interact with them, neumorphism’s aesthetic lies on its minimal, flat yet realistic UI.<br>Neumorphic UI elements look like they’re connected to the background, as if the elements are extruded or inset into the background. They are also referred as “soft UI” because of the way soft shadows are used to create this blending effect."
      }
    ]
  },
  {
    "index": "o",
    "terms": [
      {
        "term": "Onboarding",
        "description": "Onboarding is the process of getting users familiar with a new interface. It can involve one or more of the following components: feature promotion, customization, and instructions.<br>Onboarding, with the help of dedicated flows and UI elements that are not part of the regular app interface, is usually done to not only teach users how to interact with the interface but also to complete any necessary setup for customising the user experience.<br>Onboarding can occur at multiple points in a user’s lifecycle of an app and not just limited to the first time users. It can also be done for existing users when any new features or redesigns are released."
      }
    ]
  },
  {
    "index": "p",
    "terms": [
      {
        "term": "Pain Point",
        "description": "A pain point is a specific problem that prospective customers of your business are experiencing. In other words, you can think of pain points as problems, plain and simple.<br>Conducting qualitative research along with user journey mapping can be used to get insights and subjective feedback from the customers with which UX designers can come up with solutions to solve these pain points the customers encounter while using their products or services."
      },
      {
        "term": "Persona",
        "description": "Personas in user-centered design, are fictional characters, which you create based upon your research in order to represent the different user types that might use your service, product, site, or brand in a similar way.<br>Creating personas will help you to understand your users’ needs, outlook, experiences, behaviours and goals. They can help you to achieve the goal of creating a good user experience for your target user group."
      }
    ]
  },
  {
    "index": "q",
    "terms": []
  },
  {
    "index": "r",
    "terms": []
  },
  {
    "index": "s",
    "terms": []
  },
  {
    "index": "t",
    "terms": []
  },
  {
    "index": "u",
    "terms": []
  },
  {
    "index": "v",
    "terms": []
  },
  {
    "index": "w",
    "terms": []
  },
  {
    "index": "x",
    "terms": []
  },
  {
    "index": "y",
    "terms": []
  },
  {
    "index": "z",
    "terms": []
  }
]